WfHit/wheel_loader/platforms/nuttx/src/px4/stm/stm32_common/serial/wk2132.c
  /* Setup I2C write message for register address */
  msgs[0].frequency = WK2132_I2C_FREQUENCY;
  msgs[0].addr      = i2c_addr;
  msgs[0].flags     = 0;
  msgs[0].buffer    = &reg;
  msgs[0].length    = 1;

  /* Setup I2C read message for data */
  msgs[1].frequency = WK2132_I2C_FREQUENCY;
  msgs[1].addr      = i2c_addr;
  msgs[1].flags     = I2C_M_READ;
  msgs[1].buffer    = value;
  msgs[1].length    = 1;

  /* Perform the transfer */
  ret = I2C_TRANSFER(priv->i2c, msgs, 2);
  return (ret >= 0) ? OK : ret;
}

/**
 * @brief Read from FIFO via I2C (single byte)
 *
 * As shown in timing diagram 11.2.4, FIFO read operations read data directly
 * from the FIFO without specifying a register address.
 */
static int wk2132_i2c_read_fifo(FAR struct wk2132_dev_s *priv, FAR uint8_t *value)
{
  struct i2c_msg_s msg;
  uint8_t i2c_addr;
  int ret;

  /* Construct I2C address: base_addr in bits 6-3, channel in bits 2-1, FIFO access in bit 0 */
  i2c_addr = WK2132_MAKE_I2C_ADDR(priv->base_addr, priv->port, true);

  /* Setup I2C read message - direct data read from FIFO as per timing diagram */
  msg.frequency = WK2132_I2C_FREQUENCY;
  msg.addr      = i2c_addr;
  msg.flags     = I2C_M_READ;
  msg.buffer    = value;
  msg.length    = 1;

  /* Perform the transfer */
  ret = I2C_TRANSFER(priv->i2c, &msg, 1);
  return (ret >= 0) ? OK : ret;
}

/**
 * @brief Read multiple bytes from FIFO via I2C
 *
 * As shown in timing diagram 11.2.4, FIFO read operations can handle
 * multiple data bytes in a single I2C transaction for improved efficiency.
 * This function respects FIFO buffer size limitations.
 */
static int wk2132_i2c_read_fifo_multi(FAR struct wk2132_dev_s *priv,
                                       FAR uint8_t *data, size_t length)
{
  struct i2c_msg_s msg;
  uint8_t i2c_addr;
  uint8_t fsr;
  uint8_t rfcnt;
  size_t available_data;
  size_t read_length;
  int ret;

  if (!data || length == 0)
    {
      return -EINVAL;
    }

  /* Check FIFO status to see if data is available */
  ret = wk2132_i2c_read_reg(priv, WK2132_FSR, &fsr);
  if (ret < 0)
    {
      return ret;
    }

  /* If no data available, return immediately */
  if (!(fsr & WK2132_FSR_RDAT))
    {
      return 0;  /* No data available */
    }

  /* Read RX FIFO count to determine available data */
  ret = wk2132_i2c_read_reg(priv, WK2132_RFCNT, &rfcnt);
  if (ret < 0)
    {
      return ret;
    }

  /* Determine how much data we can read */
  available_data = rfcnt;
  read_length = (length < available_data) ? length : available_data;

  if (read_length == 0)
    {
      return 0;  /* No data to read */
    }

  /* Construct I2C address: base_addr in bits 6-3, channel in bits 2-1, FIFO access in bit 0 */
  i2c_addr = WK2132_MAKE_I2C_ADDR(priv->base_addr, priv->port, true);

  /* Setup I2C read message - direct multi-byte data read from FIFO */
  msg.frequency = WK2132_I2C_FREQUENCY;
  msg.addr      = i2c_addr;
  msg.flags     = I2C_M_READ;
  msg.buffer    = data;
  msg.length    = read_length;

  /* Perform the transfer */
  ret = I2C_TRANSFER(priv->i2c, &msg, 1);
  return (ret >= 0) ? read_length : ret;  /* Return number of bytes read or error */
}

/**
 * @brief Bulk receive function for efficient multi-byte reads
 *
 * This function can read multiple bytes in a single I2C transaction,
 * respecting FIFO buffer limitations as shown in the timing diagrams.
 */
static int wk2132_bulk_receive(FAR struct uart_dev_s *dev, FAR uint8_t *buffer,
                               size_t buflen, FAR size_t *received)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  int ret;

  if (!buffer || !received || buflen == 0)
    {
      return -EINVAL;
    }

  if (!priv->enabled)
    {
      *received = 0;
      return -ENODEV;
    }

  /* Use multi-byte FIFO read for efficiency */
  ret = wk2132_i2c_read_fifo_multi(priv, buffer, buflen);

  if (ret < 0)
    {
      *received = 0;
      return ret;
    }

  *received = ret;  /* ret contains number of bytes actually read */
  return OK;
}

/**
 * @brief Bulk send function for efficient multi-byte writes
 *
 * This function can write multiple bytes in a single I2C transaction,
 * respecting FIFO buffer limitations as shown in the timing diagrams.
 */
static int wk2132_bulk_send(FAR struct uart_dev_s *dev, FAR const uint8_t *buffer,
                            size_t buflen, FAR size_t *sent)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  int ret;

  if (!buffer || !sent || buflen == 0)
    {
      return -EINVAL;
    }

  if (!priv->enabled)
    {
      *sent = 0;
      return -ENODEV;
    }

  /* Use multi-byte FIFO write for efficiency */
  ret = wk2132_i2c_write_fifo_multi(priv, buffer, buflen);

  if (ret < 0)
    {
      *sent = 0;
      return ret;
    }

  *sent = ret;  /* ret contains number of bytes actually written */
  return OK;
}

/**
 * @brief Set baud rate for a UART port
 */
static int wk2132_set_baud(FAR struct wk2132_dev_s *priv, uint32_t baud)
{
  uint32_t divisor;
  uint8_t baud1, baud0, pres;
  int ret;

  /* Calculate baud rate divisor
   * Baud = Crystal_Freq / (PRES * (BAUD1*256 + BAUD0) * 16)
   * For simplicity, we'll use PRES = 1
   */
  divisor = WK2132_CRYSTAL_FREQ / (baud * 16);

  if (divisor > 0xFFFF)
    {
      /* Use prescaler */
      pres = 4;
      divisor = WK2132_CRYSTAL_FREQ / (baud * 16 * 4);
    }
  else
    {
      pres = 1;
    }

  if (divisor > 0xFFFF)
    {
      return -EINVAL;  /* Baud rate too low */
    }

  baud1 = (divisor >> 8) & 0xFF;
  baud0 = divisor & 0xFF;

  /* Select sub-page 1 for baud rate configuration */
  ret = wk2132_i2c_write_reg(priv, WK2132_SPAGE, 1);
  if (ret < 0)
    {
      return ret;
    }

  /* Set baud rate registers */
  ret = wk2132_i2c_write_reg(priv, WK2132_BAUD1, baud1);
  if (ret < 0)
    {
      return ret;
    }

  ret = wk2132_i2c_write_reg(priv, WK2132_BAUD0, baud0);
  if (ret < 0)
    {
      return ret;
    }

  ret = wk2132_i2c_write_reg(priv, WK2132_PRES, pres);
  if (ret < 0)
    {
      return ret;
    }

