WfHit/wheel_loader/platforms/nuttx/src/px4/stm/stm32_common/serial/wk2132.c
  /* Get line status */
  ret = wk2132_i2c_read_reg(priv, WK2132_LSR, &lsr);
  if (ret < 0)
    {
      return -EIO;
    }

  *status = (fsr << 8) | lsr;

  /* Read data from FIFO */
  ret = wk2132_i2c_read_fifo(priv, &rxdata);
  if (ret < 0)
    {
      return -EIO;
    }

  return rxdata;
}

/**
 * @brief Enable/disable RX interrupt
 */
static void wk2132_rxint(FAR struct uart_dev_s *dev, bool enable)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  uint8_t sier;

  /* Read current interrupt enable register */
  if (wk2132_i2c_read_reg(priv, WK2132_SIER, &sier) < 0)
    {
      return;
    }

  /* Enable/disable RX interrupt */
  if (enable)
    {
      sier |= WK2132_SIER_RFTRIG_IEN;
    }
  else
    {
      sier &= ~WK2132_SIER_RFTRIG_IEN;
    }

  wk2132_i2c_write_reg(priv, WK2132_SIER, sier);
}

/**
 * @brief Check if RX data available
 */
static bool wk2132_rxavailable(FAR struct uart_dev_s *dev)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  uint8_t fsr;

  if (!priv->enabled)
    {
      return false;
    }

  /* Check FIFO status register for available data */
  if (wk2132_i2c_read_reg(priv, WK2132_FSR, &fsr) < 0)
    {
      return false;
    }

  return (fsr & WK2132_FSR_RDAT) != 0;
}

/**
 * @brief Send character
 */
static void wk2132_send(FAR struct uart_dev_s *dev, int ch)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;

  /* Write data to FIFO */
  wk2132_i2c_write_fifo(priv, (uint8_t)ch);
}

/**
 * @brief Enable/disable TX interrupt
 */
static void wk2132_txint(FAR struct uart_dev_s *dev, bool enable)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  uint8_t sier;

  /* Read current interrupt enable register */
  if (wk2132_i2c_read_reg(priv, WK2132_SIER, &sier) < 0)
    {
      return;
    }

  /* Enable/disable TX interrupt */
  if (enable)
    {
      sier |= WK2132_SIER_TFTRIG_IEN;
    }
  else
    {
      sier &= ~WK2132_SIER_TFTRIG_IEN;
    }

  wk2132_i2c_write_reg(priv, WK2132_SIER, sier);
}

/**
 * @brief Check if TX ready
 */
static bool wk2132_txready(FAR struct uart_dev_s *dev)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  uint8_t fsr;

  if (!priv->enabled)
    {
      return false;
    }

  /* Check FIFO status register */
  if (wk2132_i2c_read_reg(priv, WK2132_FSR, &fsr) < 0)
    {
      return false;
    }

  /* Return true if TX FIFO is not full */
  return (fsr & WK2132_FSR_TFULL) == 0;
}

/**
 * @brief Check if TX empty
 */
static bool wk2132_txempty(FAR struct uart_dev_s *dev)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  uint8_t fsr;

  if (!priv->enabled)
    {
      return true;
    }

  /* Check FIFO status register */
  if (wk2132_i2c_read_reg(priv, WK2132_FSR, &fsr) < 0)
    {
      return false;
    }

  /* Return true if TX is not busy and no data available */
  return ((fsr & WK2132_FSR_TBUSY) == 0) && ((fsr & WK2132_FSR_TDAT) == 0);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/**
 * @brief Initialize a WK2132 UART port
 */
FAR struct uart_dev_s *wk2132_uart_init(FAR struct i2c_master_s *i2c,
                                         uint8_t base_addr, uint8_t port)
{
  FAR struct wk2132_dev_s *priv;
  FAR struct uart_dev_s *dev;
  int ret;

  /* Validate parameters */
  if (!i2c || port < 1 || port > WK2132_MAX_PORTS)
    {
      return NULL;
    }

  /* Allocate device structures */
  priv = (FAR struct wk2132_dev_s *)kmm_zalloc(sizeof(struct wk2132_dev_s));
  if (priv == NULL)
    {
      return NULL;
    }

  dev = (FAR struct uart_dev_s *)kmm_zalloc(sizeof(struct uart_dev_s));
  if (dev == NULL)
    {
      kmm_free(priv);
      return NULL;
    }

  /* Initialize private structure */
  priv->i2c       = i2c;
  priv->base_addr = base_addr;
  priv->port      = port;
  priv->baud      = 115200;  /* Default baud rate */
  priv->parity    = 0;       /* No parity */
  priv->nbits     = 8;       /* 8 data bits */
  priv->stopbits2 = false;   /* 1 stop bit */
  priv->enabled   = false;

  nxsem_init(&priv->exclsem, 0, 1);

  /* Initialize public structure */
  dev->ops      = &g_wk2132_uart_ops;
  dev->priv     = priv;
  dev->isconsole = false;

  /* Allocate RX/TX buffers */
  dev->xmit.size   = 256;
  dev->xmit.buffer = (FAR char *)kmm_malloc(dev->xmit.size);
  if (dev->xmit.buffer == NULL)
    {
      goto errout;
    }

  dev->recv.size   = 256;
  dev->recv.buffer = (FAR char *)kmm_malloc(dev->recv.size);
  if (dev->recv.buffer == NULL)
    {
      goto errout;
    }

  /* Test if device is present by reading a global register */
  uint8_t test;
  ret = wk2132_i2c_read_global(priv, WK2132_GENA, &test);
  if (ret < 0)
    {
      syslog(LOG_ERR, "WK2132: Failed to detect device at base_addr 0x%02x\n", base_addr);
      goto errout;
    }

  /* Add to device list for polling */
  if (g_wk2132_device_count < WK2132_MAX_PORTS)
    {
      g_wk2132_devices[g_wk2132_device_count++] = dev;
    }

  syslog(LOG_INFO, "WK2132: Initialized port %d with base_addr 0x%02x\n", port, base_addr);
  return dev;

errout:
  if (dev->xmit.buffer)
    {
      kmm_free(dev->xmit.buffer);
    }
  if (dev->recv.buffer)
    {
      kmm_free(dev->recv.buffer);
    }
  kmm_free(dev);
  kmm_free(priv);
  return NULL;
}

/**
 * @brief Register WK2132 serial devices
 */
int wk2132_register_devices(int i2c_bus, uint8_t i2c_base_addr,
                            int base_tty, int num_ports)
{
  FAR struct i2c_master_s *i2c;
  FAR struct uart_dev_s *devs[WK2132_MAX_PORTS];
  char devpath[16];
  int i;
  int ret;

  /* Validate parameters */
  if (num_ports < 1 || num_ports > WK2132_MAX_PORTS)
    {
      return -EINVAL;
    }

  /* Get I2C bus instance */
  i2c = stm32_i2cbus_initialize(i2c_bus);
  if (i2c == NULL)
    {
      syslog(LOG_ERR, "WK2132: Failed to get I2C%d\n", i2c_bus);
      return -ENODEV;
    }

  /* Initialize UART ports */
  for (i = 0; i < num_ports; i++)
    {
      devs[i] = wk2132_uart_init(i2c, i2c_base_addr, i + 1);
      if (devs[i] == NULL)
        {
          syslog(LOG_ERR, "WK2132: Failed to initialize port %d\n", i + 1);
          ret = -ENODEV;
          goto cleanup;
        }
    }

  /* Register UART devices */
  for (i = 0; i < num_ports; i++)
    {
      snprintf(devpath, sizeof(devpath), "/dev/ttyS%d", base_tty + i);
      ret = uart_register(devpath, devs[i]);
      if (ret < 0)
        {
          syslog(LOG_ERR, "WK2132: Failed to register %s\n", devpath);
          goto cleanup;
        }

      syslog(LOG_INFO, "WK2132: Registered %s for port %d\n", devpath, i + 1);
    }

  return OK;

cleanup:
  /* Cleanup on failure */
  for (int j = 0; j < i; j++)
    {
      if (devs[j])
        {
          /* Note: uart_unregister would be called here if it existed */
          /* For now, we'll just free the memory */
          if (devs[j]->xmit.buffer)
            {
              kmm_free(devs[j]->xmit.buffer);
            }
          if (devs[j]->recv.buffer)
            {
              kmm_free(devs[j]->recv.buffer);
            }
          kmm_free(devs[j]->priv);
          kmm_free(devs[j]);
        }
    }

  return ret;
}
